# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.317464  0.229088  1.522267
c -1.628700  0.050777 -1.118488
e  0.126996 -0.929525 -0.523937
f -0.554432 -0.558044 -0.464034
h  0.231762 -1.921725 -0.405239

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.317464  0.229088  1.522267  bar   True
c -1.628700  0.050777 -1.118488  bar  False
e  0.126996 -0.929525 -0.523937  bar   True
f -0.554432 -0.558044 -0.464034  bar  False
h  0.231762 -1.921725 -0.405239  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.317464  0.229088  1.522267  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -1.628700  0.050777 -1.118488  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.126996 -0.929525 -0.523937  bar   True
f -0.554432 -0.558044 -0.464034  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  0.231762 -1.921725 -0.405239  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [5]:
#### index row 'c' below
df2.loc['c']

one        -1.6287
two      0.0507773
three     -1.11849
four           bar
five         False
Name: c, dtype: object

In [6]:
#### index column 'two' below
df2.two

a    0.229088
b         NaN
c    0.050777
d         NaN
e   -0.929525
f   -0.558044
g         NaN
h   -1.921725
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [7]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [8]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [9]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/series.py:935: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
/opt/tljh/user/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN  0.229088
c       NaN  0.050777
e       NaN -0.929525
f -0.554432 -0.558044
h  0.231762 -1.921725

In [10]:
b = df[['one','two','three']]
b

        one       two     three
a  0.317464  0.229088  1.522267
c -1.628700  0.050777 -1.118488
e  0.126996 -0.929525 -0.523937
f -0.554432 -0.558044 -0.464034
h  0.231762 -1.921725 -0.405239

In [11]:
a + b

        one  three       two
a       NaN    NaN  0.458175
c       NaN    NaN  0.101555
e       NaN    NaN -1.859049
f -1.108863    NaN -1.116088
h  0.463525    NaN -3.843449

In [12]:
b + a # in this particular case, the dataframes are the same

        one  three       two
a       NaN    NaN  0.458175
c       NaN    NaN  0.101555
e       NaN    NaN -1.859049
f -1.108863    NaN -1.116088
h  0.463525    NaN -3.843449

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [13]:
a['one'].dropna()

f   -0.554432
h    0.231762
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [14]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  0.229088
c  0.050777
e -0.929525
f -0.558044
h -1.921725

In [15]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  0.458175
c       NaN  0.101555
e       NaN -1.859049
f -1.108863 -1.116088
h  0.463525 -3.843449

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [16]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  0.458175
c       NaN  0.101555
e       NaN -1.859049
f -1.108863 -1.116088
h  0.463525 -3.843449

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [17]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [18]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [19]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [20]:
my_series.fillna(method='bfill') #used with time series, sequential data

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [21]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a -0.551148  0.205658  1.939226
b -2.396156 -1.595550  2.239661
c       NaN       NaN -1.067615
d       NaN       NaN       NaN
e -0.728298  0.658583 -0.766743

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [22]:
#### insert your code here

#we have a multiple column dataframe, so we need to put in 'inplace=true' to update the other 
# in correct terms, just update the dataframe
rand_df['one'].fillna(1, inplace=True)
rand_df['two'].fillna(method='ffill', inplace=True)
rand_df['three'].fillna(method='bfill', inplace=True)
rand_df

        one       two     three
a -0.551148  0.205658  1.939226
b -2.396156 -1.595550  2.239661
c  1.000000 -1.595550 -1.067615
d  1.000000 -1.595550 -0.766743
e -0.728298  0.658583 -0.766743

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [23]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a  0.395393  2.083001       NaN
b -0.815873 -0.649463 -0.349825
c       NaN       NaN -1.053838
d -0.224152 -0.306623  0.875992
e -0.870609  0.626709 -1.180137

# last step before dataframe goes into model, we check if any values are null

In [24]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [25]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A   -0.378810
B    0.438406
C   -0.426952
dtype: float64

In [26]:
df_filled = my_df.fillna(my_df.mean())
df_filled
#a1: make sure the imputed value is actually the mean in cell block above
#should have a way to manually verify imputed values are correct.

          A         B         C
a  0.395393  2.083001 -0.426952
b -0.815873 -0.649463 -0.349825
c -0.378810  0.438406 -1.053838
d -0.224152 -0.306623  0.875992
e -0.870609  0.626709 -1.180137

In [27]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.